uhnp/src/DataProcessors/МатрицаПолномочий/МатрицаПолномочий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МатрицаПолномочий</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Бланк</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланированияОтбор</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЗСтрокАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЗКолонокАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательнаяСКДАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончательнаяСКДНастройкиАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйГоризонт</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>КэшАналитикПоказателейАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДиаграммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтображенияРесурсов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыСводнойТаблицы</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантыДиаграммы</name>
  </attributes>
  <attributes>
    <name>ВыбранныеПоказателиАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Масштаб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеПоляАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставлениеПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаДанныеРасшифровки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресТаблицИнтерфейса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтруктураФильтров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОсновногоЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТаблицы</name>
    <type>
      <types>EnumRef.НазначенияИспользованияСводнойТаблицы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТзДобавленныхАналитикАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>тзДанныеАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>логИзмененныхПоказателейАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСтатусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КэшАналитикПоказателейСТАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОбратногоРаспределения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТЗСрезАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьСуммыВДопВалютах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЗСтрокСОтборомАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТолькоИтогиПоПериодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТзОткрытыеПериодыСценарииАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>логИзмененныхДанныхАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСравненияСБазой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>EnumRef.РежимыРаботыСводнойТаблицы</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимТрассировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СТ_ДополнительныеНастройки_Объект</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>НарастающийИтог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимСкользящегоПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацииИзРегламента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/РегистрМатрицыПолномочий/РегистрМатрицыПолномочий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрМатрицыПолномочий</name>
  <resources>
    <name>Исполняющий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </resources>
  <resources>
    <name>Исполняющий_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Согласование</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </resources>
  <resources>
    <name>Согласование_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияРегламентаПодготовкиОтчетности</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/DataProcessors/МатрицаПолномочий/Forms/ФормаРедактированияОтветственных/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Параметры_ = ПолучитьИзВременногоХранилища(Параметры.АдресПараметров);
	АдресТекущихПараметров = Параметры.АдресПараметров;
	Если  Параметры_.Свойство("Исполняющий") Тогда
		Исполнитель = Параметры_.Исполняющий;
		Элементы.Согласование.Видимость = Ложь;
	ИначеЕсли Параметры_.Свойство("Согласование") Тогда	
		Согласование = Параметры_.Согласование;
		Элементы.Исполнитель.Видимость = Ложь;
	КонецЕсли;
	
	ТипОбъектаСогласования = Параметры.ТипОбъектаСогласования;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Применить(Команда)
	
	ЗаписатьТекущиеДанные();	
	Закрыть();
		
КонецПроцедуры


Функция ЗаписатьТекущиеДанные()
	
	ТекущиеПарамтеры = ПолучитьИзВременногоХранилища(АдресТекущихПараметров);
		
	НаборПолномочия = РегистрыСведений.РегистрМатрицыПолномочий.СоздатьНаборЗаписей();
	НаборПолномочия.Отбор.ДокументБД.Установить(ТекущиеПарамтеры.ДокументБД);
	НаборПолномочия.Отбор.ШаблонДокументаБД.Установить(ТекущиеПарамтеры.ШаблонДокументаБД); 
	НаборПолномочия.Отбор.ВерсияРегламентаПодготовкиОтчетности.Установить(ТекущиеПарамтеры.ВерсияРегламентаПодготовкиОтчетности);
	Если Не ТекущиеПарамтеры.Бланк = Неопределено Тогда
		НаборПолномочия.Отбор.Бланк.Установить(ТекущиеПарамтеры.Бланк);
	КонецЕсли;
	Если Не ТекущиеПарамтеры.Проект = Неопределено Тогда
		НаборПолномочия.Отбор.Проект.Установить(ТекущиеПарамтеры.Проект);
	КонецЕсли;
	Если Не ТекущиеПарамтеры.Организация = Неопределено Тогда
		НаборПолномочия.Отбор.Организация.Установить(ТекущиеПарамтеры.Организация);
	КонецЕсли;

	НаборПолномочия.Прочитать();
	Если НаборПолномочия.Количество() =0 Тогда
		Нзп = НаборПолномочия.Добавить();
	Иначе
		Нзп = НаборПолномочия[0];	
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Нзп,ТекущиеПарамтеры);
	Если  ТекущиеПарамтеры.Свойство("Исполняющий") Тогда
		Нзп.Исполняющий = Исполнитель;
	ИначеЕсли ТекущиеПарамтеры.Свойство("Согласование") Тогда	
		Нзп.Согласование = Согласование;
	КонецЕсли;
	НаборПолномочия.Записать(Истина);
	
КонецФункции
